---
kind: type
id: T:Autodesk.Revit.DB.FilterStringBeginsWith
source: html/09866c64-9254-ec1a-bc83-fc105ffabc93.htm
---
# Autodesk.Revit.DB.FilterStringBeginsWith

Tests whether string values from the document begin with a certain string.

## Syntax (C#)
```csharp
public class FilterStringBeginsWith : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.